ryankurte/efm32-base/device/BGM21/Include/bgm210p032jia1.h
/* GPIO Avalibility Info */
#define GPIO_PA_INDEX                              0U         /**< Index of port PA */
#define GPIO_PA_COUNT                              7U         /**< Number of pins on port PA */
#define GPIO_PA_MASK                               (0x007FUL) /**< Port PA pin mask */
#define GPIO_PA_PIN0                               1U         /**< GPIO pin PA0 is present. */
#define GPIO_PA_PIN1                               1U         /**< GPIO pin PA1 is present. */
#define GPIO_PA_PIN2                               1U         /**< GPIO pin PA2 is present. */
#define GPIO_PA_PIN3                               1U         /**< GPIO pin PA3 is present. */
#define GPIO_PA_PIN4                               1U         /**< GPIO pin PA4 is present. */
#define GPIO_PA_PIN5                               1U         /**< GPIO pin PA5 is present. */
#define GPIO_PA_PIN6                               1U         /**< GPIO pin PA6 is present. */
#define GPIO_PB_INDEX                              1U         /**< Index of port PB */
#define GPIO_PB_COUNT                              2U         /**< Number of pins on port PB */
#define GPIO_PB_MASK                               (0x0003UL) /**< Port PB pin mask */
#define GPIO_PB_PIN0                               1U         /**< GPIO pin PB0 is present. */
#define GPIO_PB_PIN1                               1U         /**< GPIO pin PB1 is present. */
#define GPIO_PC_INDEX                              2U         /**< Index of port PC */
#define GPIO_PC_COUNT                              6U         /**< Number of pins on port PC */
#define GPIO_PC_MASK                               (0x003FUL) /**< Port PC pin mask */
#define GPIO_PC_PIN0                               1U         /**< GPIO pin PC0 is present. */
#define GPIO_PC_PIN1                               1U         /**< GPIO pin PC1 is present. */
#define GPIO_PC_PIN2                               1U         /**< GPIO pin PC2 is present. */
#define GPIO_PC_PIN3                               1U         /**< GPIO pin PC3 is present. */
#define GPIO_PC_PIN4                               1U         /**< GPIO pin PC4 is present. */
#define GPIO_PC_PIN5                               1U         /**< GPIO pin PC5 is present. */
#define GPIO_PD_INDEX                              3U         /**< Index of port PD */
#define GPIO_PD_COUNT                              5U         /**< Number of pins on port PD */
#define GPIO_PD_MASK                               (0x001FUL) /**< Port PD pin mask */
#define GPIO_PD_PIN0                               1U         /**< GPIO pin PD0 is present. */
#define GPIO_PD_PIN1                               1U         /**< GPIO pin PD1 is present. */
#define GPIO_PD_PIN2                               1U         /**< GPIO pin PD2 is present. */
#define GPIO_PD_PIN3                               1U         /**< GPIO pin PD3 is present. */
#define GPIO_PD_PIN4                               1U         /**< GPIO pin PD4 is present. */

/* Fixed Resource Locations */
#define GPIO_SWCLK_PORT                            GPIO_PA_INDEX /**< Port of SWCLK.*/
#define GPIO_SWCLK_PIN                             1U            /**< Pin of SWCLK.*/
#define GPIO_SWDIO_PORT                            GPIO_PA_INDEX /**< Port of SWDIO.*/
#define GPIO_SWDIO_PIN                             2U            /**< Pin of SWDIO.*/
#define GPIO_SWV_PORT                              GPIO_PA_INDEX /**< Port of SWV.*/
#define GPIO_SWV_PIN                               3U            /**< Pin of SWV.*/
#define GPIO_TDI_PORT                              GPIO_PA_INDEX /**< Port of TDI.*/
#define GPIO_TDI_PIN                               4U            /**< Pin of TDI.*/
#define GPIO_TDO_PORT                              GPIO_PA_INDEX /**< Port of TDO.*/
#define GPIO_TDO_PIN                               3U            /**< Pin of TDO.*/
#define GPIO_TRACECLK_PORT                         GPIO_PA_INDEX /**< Port of TRACECLK.*/
#define GPIO_TRACECLK_PIN                          4U            /**< Pin of TRACECLK.*/
#define GPIO_TRACEDATA0_PORT                       GPIO_PA_INDEX /**< Port of TRACEDATA0.*/
#define GPIO_TRACEDATA0_PIN                        3U            /**< Pin of TRACEDATA0.*/
#define GPIO_EM4WU0_PORT                           GPIO_PA_INDEX /**< Port of EM4WU0.*/
#define GPIO_EM4WU0_PIN                            5U            /**< Pin of EM4WU0.*/
#define GPIO_EM4WU3_PORT                           GPIO_PB_INDEX /**< Port of EM4WU3.*/
#define GPIO_EM4WU3_PIN                            1U            /**< Pin of EM4WU3.*/
#define GPIO_EM4WU6_PORT                           GPIO_PC_INDEX /**< Port of EM4WU6.*/
#define GPIO_EM4WU6_PIN                            0U            /**< Pin of EM4WU6.*/
#define GPIO_EM4WU7_PORT                           GPIO_PC_INDEX /**< Port of EM4WU7.*/
#define GPIO_EM4WU7_PIN                            5U            /**< Pin of EM4WU7.*/
#define GPIO_EM4WU9_PORT                           GPIO_PD_INDEX /**< Port of EM4WU9.*/
#define GPIO_EM4WU9_PIN                            2U            /**< Pin of EM4WU9.*/
#define LFXO_LFXTAL_I_PORT                         GPIO_PD_INDEX /**< Port of LFXTAL_I.*/
#define LFXO_LFXTAL_I_PIN                          1U            /**< Pin of LFXTAL_I.*/
#define LFXO_LFXTAL_O_PORT                         GPIO_PD_INDEX /**< Port of LFXTAL_O.*/
#define LFXO_LFXTAL_O_PIN                          0U            /**< Pin of LFXTAL_O.*/
#define LFXO_LF_EXTCLK_PORT                        GPIO_PD_INDEX /**< Port of LF_EXTCLK.*/
#define LFXO_LF_EXTCLK_PIN                         1U            /**< Pin of LF_EXTCLK.*/

/* Part number capabilities */
#define ACMP_PRESENT                                 /** ACMP is available in this part */
#define ACMP_COUNT                                 2 /** 2 ACMPs available  */
#define AGC_PRESENT                                  /** AGC is available in this part */
#define AGC_COUNT                                  1 /** 1 AGCs available  */
#define AMUXCP_PRESENT                               /** AMUXCP is available in this part */
#define AMUXCP_COUNT                               1 /** 1 AMUXCPs available  */
#define BUFC_PRESENT                                 /** BUFC is available in this part */
#define BUFC_COUNT                                 1 /** 1 BUFCs available  */
#define BURAM_PRESENT                                /** BURAM is available in this part */
#define BURAM_COUNT                                1 /** 1 BURAMs available  */
#define BURTC_PRESENT                                /** BURTC is available in this part */
#define BURTC_COUNT                                1 /** 1 BURTCs available  */
#define CMU_PRESENT                                  /** CMU is available in this part */
#define CMU_COUNT                                  1 /** 1 CMUs available  */
#define DPLL_PRESENT                                 /** DPLL is available in this part */
#define DPLL_COUNT                                 1 /** 1 DPLLs available  */
#define EMU_PRESENT                                  /** EMU is available in this part */
#define EMU_COUNT                                  1 /** 1 EMUs available  */
#define FRC_PRESENT                                  /** FRC is available in this part */
#define FRC_COUNT                                  1 /** 1 FRCs available  */
#define FSRCO_PRESENT                                /** FSRCO is available in this part */
#define FSRCO_COUNT                                1 /** 1 FSRCOs available  */
#define GPCRC_PRESENT                                /** GPCRC is available in this part */
#define GPCRC_COUNT                                1 /** 1 GPCRCs available  */
#define GPIO_PRESENT                                 /** GPIO is available in this part */
#define GPIO_COUNT                                 1 /** 1 GPIOs available  */
#define HFRCO_PRESENT                                /** HFRCO is available in this part */
#define HFRCO_COUNT                                1 /** 1 HFRCOs available  */
#define HFRCOEM23_PRESENT                            /** HFRCOEM23 is available in this part */
#define HFRCOEM23_COUNT                            1 /** 1 HFRCOEM23s available  */
#define HFXO_PRESENT                                 /** HFXO is available in this part */
#define HFXO_COUNT                                 1 /** 1 HFXOs available  */
#define I2C_PRESENT                                  /** I2C is available in this part */
#define I2C_COUNT                                  2 /** 2 I2Cs available  */
#define IADC_PRESENT                                 /** IADC is available in this part */
#define IADC_COUNT                                 1 /** 1 IADCs available  */
#define ICACHE_PRESENT                               /** ICACHE is available in this part */
#define ICACHE_COUNT                               1 /** 1 ICACHEs available  */
#define LDMA_PRESENT                                 /** LDMA is available in this part */
#define LDMA_COUNT                                 1 /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                             /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                             1 /** 1 LDMAXBARs available  */
#define LETIMER_PRESENT                              /** LETIMER is available in this part */
#define LETIMER_COUNT                              1 /** 1 LETIMERs available  */
#define LFRCO_PRESENT                                /** LFRCO is available in this part */
#define LFRCO_COUNT                                1 /** 1 LFRCOs available  */
#define LFXO_PRESENT                                 /** LFXO is available in this part */
#define LFXO_COUNT                                 1 /** 1 LFXOs available  */
#define LVGD_PRESENT                                 /** LVGD is available in this part */
#define LVGD_COUNT                                 1 /** 1 LVGDs available  */
#define MODEM_PRESENT                                /** MODEM is available in this part */
#define MODEM_COUNT                                1 /** 1 MODEMs available  */
#define MSC_PRESENT                                  /** MSC is available in this part */
#define MSC_COUNT                                  1 /** 1 MSCs available  */
#define PROTIMER_PRESENT                             /** PROTIMER is available in this part */
#define PROTIMER_COUNT                             1 /** 1 PROTIMERs available  */
#define PRS_PRESENT                                  /** PRS is available in this part */
#define PRS_COUNT                                  1 /** 1 PRSs available  */
#define RAC_PRESENT                                  /** RAC is available in this part */
#define RAC_COUNT                                  1 /** 1 RACs available  */
#define RADIOAES_PRESENT                             /** RADIOAES is available in this part */
#define RADIOAES_COUNT                             1 /** 1 RADIOAESs available  */
#define RFCRC_PRESENT                                /** RFCRC is available in this part */
#define RFCRC_COUNT                                1 /** 1 RFCRCs available  */
#define RTCC_PRESENT                                 /** RTCC is available in this part */
#define RTCC_COUNT                                 1 /** 1 RTCCs available  */
#define SEMAILBOX_PRESENT                            /** SEMAILBOX is available in this part */
#define SEMAILBOX_COUNT                            1 /** 1 SEMAILBOXs available  */
#define SMU_PRESENT                                  /** SMU is available in this part */
#define SMU_COUNT                                  1 /** 1 SMUs available  */
#define SYNTH_PRESENT                                /** SYNTH is available in this part */
#define SYNTH_COUNT                                1 /** 1 SYNTHs available  */
#define SYSCFG_PRESENT                               /** SYSCFG is available in this part */
#define SYSCFG_COUNT                               1 /** 1 SYSCFGs available  */
#define TIMER_PRESENT                                /** TIMER is available in this part */
#define TIMER_COUNT                                4 /** 4 TIMERs available  */
#define ULFRCO_PRESENT                               /** ULFRCO is available in this part */
#define ULFRCO_COUNT                               1 /** 1 ULFRCOs available  */
#define USART_PRESENT                                /** USART is available in this part */
#define USART_COUNT                                3 /** 3 USARTs available  */
#define WDOG_PRESENT                                 /** WDOG is available in this part */
#define WDOG_COUNT                                 2 /** 2 WDOGs available  */
#define DEVINFO_PRESENT                              /** DEVINFO is available in this part */
#define DEVINFO_COUNT                              1 /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core*/
#include "core_cm33.h"    /* Core Header File */
#include "system_bgm21.h" /* System Header File */

/** @} End of group BGM210P032JIA1_Part */

/**************************************************************************//**
 * @defgroup BGM210P032JIA1_Peripheral_TypeDefs BGM210P032JIA1 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
#include "bgm21_emu.h"
#include "bgm21_cmu.h"
#include "bgm21_hfxo.h"
#include "bgm21_hfrco.h"
#include "bgm21_fsrco.h"
#include "bgm21_dpll.h"
#include "bgm21_lfxo.h"
#include "bgm21_lfrco.h"
#include "bgm21_ulfrco.h"
#include "bgm21_msc.h"
#include "bgm21_icache.h"
#include "bgm21_prs.h"
#include "bgm21_gpio.h"
#include "bgm21_ldma.h"
#include "bgm21_ldmaxbar.h"
#include "bgm21_timer.h"
#include "bgm21_usart.h"
#include "bgm21_burtc.h"
#include "bgm21_i2c.h"
#include "bgm21_lvgd.h"
#include "bgm21_syscfg.h"
#include "bgm21_buram.h"
#include "bgm21_gpcrc.h"
#include "bgm21_aes.h"
#include "bgm21_bufc.h"
#include "bgm21_smu.h"
#include "bgm21_rtcc.h"
#include "bgm21_letimer.h"
#include "bgm21_iadc.h"
#include "bgm21_acmp.h"
#include "bgm21_wdog.h"
#include "bgm21_amuxcp.h"
#include "bgm21_semailbox.h"
#include "bgm21_frc.h"
#include "bgm21_agc.h"
#include "bgm21_rfcrc.h"
#include "bgm21_modem.h"
#include "bgm21_synth.h"
#include "bgm21_protimer.h"
#include "bgm21_rac.h"
#include "bgm21_devinfo.h"

/* Custom headers for LDMAXBAR and PRS mappings*/
#include "bgm21_prs_signals.h"
#include "bgm21_dma_descriptor.h"
#include "bgm21_ldmaxbar_defines.h"

/** @} End of group BGM210P032JIA1_Peripheral_TypeDefs  */

/**************************************************************************//**
 * @defgroup BGM210P032JIA1_Peripheral_Base BGM210P032JIA1 Peripheral Memory Map
 * @{
 *****************************************************************************/

#define EMU_BASE                  (0x40004000UL) /* EMU base address */
#define CMU_BASE                  (0x40008000UL) /* CMU base address */
#define HFXO0_BASE                (0x4000C000UL) /* HFXO0 base address */
#define HFRCO0_BASE               (0x40010000UL) /* HFRCO0 base address */
#define FSRCO_BASE                (0x40018000UL) /* FSRCO base address */
#define DPLL0_BASE                (0x4001C000UL) /* DPLL0 base address */
#define LFXO_BASE                 (0x40020000UL) /* LFXO base address */
#define LFRCO_BASE                (0x40024000UL) /* LFRCO base address */
#define ULFRCO_BASE               (0x40028000UL) /* ULFRCO base address */
#define MSC_BASE                  (0x40030000UL) /* MSC base address */
#define ICACHE0_BASE              (0x40034000UL) /* ICACHE0 base address */
#define PRS_BASE                  (0x40038000UL) /* PRS base address */
#define GPIO_BASE                 (0x4003C000UL) /* GPIO base address */
#define LDMA_BASE                 (0x40040000UL) /* LDMA base address */
#define LDMAXBAR_BASE             (0x40044000UL) /* LDMAXBAR base address */
#define TIMER0_BASE               (0x40048000UL) /* TIMER0 base address */
#define TIMER1_BASE               (0x4004C000UL) /* TIMER1 base address */
#define TIMER2_BASE               (0x40050000UL) /* TIMER2 base address */
#define TIMER3_BASE               (0x40054000UL) /* TIMER3 base address */
#define USART0_BASE               (0x40058000UL) /* USART0 base address */
#define USART1_BASE               (0x4005C000UL) /* USART1 base address */
#define USART2_BASE               (0x40060000UL) /* USART2 base address */
#define BURTC_BASE                (0x40064000UL) /* BURTC base address */
#define I2C1_BASE                 (0x40068000UL) /* I2C1 base address */
#define LVGD_BASE                 (0x40074000UL) /* LVGD base address */
#define SYSCFG_BASE               (0x4007C000UL) /* SYSCFG base address */
#define BURAM_BASE                (0x40080000UL) /* BURAM base address */
#define GPCRC_BASE                (0x40088000UL) /* GPCRC base address */
#define RADIOAES_BASE             (0x44000000UL) /* RADIOAES base address */
#define BUFC_BASE                 (0x44004000UL) /* BUFC base address */
#define SMU_BASE                  (0x44008000UL) /* SMU base address */
#define RTCC_BASE                 (0x48000000UL) /* RTCC base address */
#define LETIMER0_BASE             (0x4A000000UL) /* LETIMER0 base address */
#define IADC0_BASE                (0x4A004000UL) /* IADC0 base address */
#define ACMP0_BASE                (0x4A008000UL) /* ACMP0 base address */
#define ACMP1_BASE                (0x4A00C000UL) /* ACMP1 base address */
#define I2C0_BASE                 (0x4A010000UL) /* I2C0 base address */
#define HFRCOEM23_BASE            (0x4A014000UL) /* HFRCOEM23 base address */
#define WDOG0_BASE                (0x4A018000UL) /* WDOG0 base address */
#define WDOG1_BASE                (0x4A01C000UL) /* WDOG1 base address */
#define AMUXCP0_BASE              (0x4A020000UL) /* AMUXCP0 base address */
#define SEMAILBOX_HOST_BASE       (0x4C000000UL) /* SEMAILBOX_HOST base address */
#define EMU_NS_BASE               (0x50004000UL) /* EMU_NS base address */
#define CMU_NS_BASE               (0x50008000UL) /* CMU_NS base address */
#define HFXO0_NS_BASE             (0x5000C000UL) /* HFXO0_NS base address */
#define HFRCO0_NS_BASE            (0x50010000UL) /* HFRCO0_NS base address */
#define FSRCO_NS_BASE             (0x50018000UL) /* FSRCO_NS base address */
#define DPLL0_NS_BASE             (0x5001C000UL) /* DPLL0_NS base address */
#define LFXO_NS_BASE              (0x50020000UL) /* LFXO_NS base address */
#define LFRCO_NS_BASE             (0x50024000UL) /* LFRCO_NS base address */
#define ULFRCO_NS_BASE            (0x50028000UL) /* ULFRCO_NS base address */
#define MSC_NS_BASE               (0x50030000UL) /* MSC_NS base address */
#define ICACHE0_NS_BASE           (0x50034000UL) /* ICACHE0_NS base address */
#define PRS_NS_BASE               (0x50038000UL) /* PRS_NS base address */
#define GPIO_NS_BASE              (0x5003C000UL) /* GPIO_NS base address */
#define LDMA_NS_BASE              (0x50040000UL) /* LDMA_NS base address */
#define LDMAXBAR_NS_BASE          (0x50044000UL) /* LDMAXBAR_NS base address */
#define TIMER0_NS_BASE            (0x50048000UL) /* TIMER0_NS base address */
#define TIMER1_NS_BASE            (0x5004C000UL) /* TIMER1_NS base address */
#define TIMER2_NS_BASE            (0x50050000UL) /* TIMER2_NS base address */
#define TIMER3_NS_BASE            (0x50054000UL) /* TIMER3_NS base address */
#define USART0_NS_BASE            (0x50058000UL) /* USART0_NS base address */
#define USART1_NS_BASE            (0x5005C000UL) /* USART1_NS base address */
#define USART2_NS_BASE            (0x50060000UL) /* USART2_NS base address */
#define BURTC_NS_BASE             (0x50064000UL) /* BURTC_NS base address */
#define I2C1_NS_BASE              (0x50068000UL) /* I2C1_NS base address */
#define LVGD_NS_BASE              (0x50074000UL) /* LVGD_NS base address */
#define SYSCFG_NS_BASE            (0x5007C000UL) /* SYSCFG_NS base address */
#define BURAM_NS_BASE             (0x50080000UL) /* BURAM_NS base address */
#define GPCRC_NS_BASE             (0x50088000UL) /* GPCRC_NS base address */
#define RADIOAES_NS_BASE          (0x54000000UL) /* RADIOAES_NS base address */
#define BUFC_NS_BASE              (0x54004000UL) /* BUFC_NS base address */
#define SMU_NS_BASE               (0x54008000UL) /* SMU_NS base address */
#define RTCC_NS_BASE              (0x58000000UL) /* RTCC_NS base address */
#define LETIMER0_NS_BASE          (0x5A000000UL) /* LETIMER0_NS base address */
#define IADC0_NS_BASE             (0x5A004000UL) /* IADC0_NS base address */
#define ACMP0_NS_BASE             (0x5A008000UL) /* ACMP0_NS base address */
#define ACMP1_NS_BASE             (0x5A00C000UL) /* ACMP1_NS base address */
#define I2C0_NS_BASE              (0x5A010000UL) /* I2C0_NS base address */
#define HFRCOEM23_NS_BASE         (0x5A014000UL) /* HFRCOEM23_NS base address */
#define WDOG0_NS_BASE             (0x5A018000UL) /* WDOG0_NS base address */
#define WDOG1_NS_BASE             (0x5A01C000UL) /* WDOG1_NS base address */
#define AMUXCP0_NS_BASE           (0x5A020000UL) /* AMUXCP0_NS base address */
#define SEMAILBOX_NS_HOST_BASE    (0x5C000000UL) /* SEMAILBOX_NS_HOST base address */
#define FRC_BASE                  (0xA8004000UL) /* FRC base address */
#define AGC_BASE                  (0xA800C000UL) /* AGC base address */
#define RFCRC_BASE                (0xA8010000UL) /* RFCRC base address */
#define MODEM_BASE                (0xA8014000UL) /* MODEM base address */
#define SYNTH_BASE                (0xA8018000UL) /* SYNTH base address */
#define PROTIMER_BASE             (0xA801C000UL) /* PROTIMER base address */
#define RAC_BASE                  (0xA8020000UL) /* RAC base address */
#define FRC_NS_BASE               (0xB8004000UL) /* FRC_NS base address */
#define AGC_NS_BASE               (0xB800C000UL) /* AGC_NS base address */
#define RFCRC_NS_BASE             (0xB8010000UL) /* RFCRC_NS base address */
#define MODEM_NS_BASE             (0xB8014000UL) /* MODEM_NS base address */
#define SYNTH_NS_BASE             (0xB8018000UL) /* SYNTH_NS base address */
#define PROTIMER_NS_BASE          (0xB801C000UL) /* PROTIMER_NS base address */
#define RAC_NS_BASE               (0xB8020000UL) /* RAC_NS base address */
#define DEVINFO_BASE              (0x0FE08000UL) /* DEVINFO base address */
/** @} End of group BGM210P032JIA1_Peripheral_Base */

/**************************************************************************//**
 * @defgroup BGM210P032JIA1_Peripheral_Declaration BGM210P032JIA1 Peripheral Declarations Map
 * @{
 *****************************************************************************/

